package pkg1;

public class Main {

	public static void main(String[] args) {
		/* 
		 * 7월 3일(월) ~ 7월 9일(일) 회고록
		 * 
		 * 파이널 프로젝트를 진행하며 참 머리도 쥐어뜯고 쉽지 않았지만,
		 * 지금 시점에 뒤돌아보면 정말 많이 성장한 것 같다.
		 * 
		 * 옛날에는 JSTL 같은 건 어렴풋이 머릿 속에 있었다면
		 * 지금에야말로 완벽하게 숙지하여 jsp로 출력하는 방법이라던지.
		 * 
		 * 모든 것이 나의 것이 되었다. 페이지네이션도 처음에는 커다란 벽이었을 뿐이었고,
		 * 웹소켓도 마찬가지로 이해조차 안되는 기술이었기 때문에 힘든 시간이었다.
		 * 
		 * 하지만 내 힘으로 구현하고 나니 이해가 되고 재미있었다.
		 * 이게 하나에 대해 종일 머리싸매다가 결국 '이게 되네' 라고 말이 나오는 것 만큼
		 * 쾌감있는 일은 지금까지 없었다.
		 * 
		 * 프로젝트 하는 건 정말 재밌어서 하나 더 만들 예정이다.
		 * 오늘도 화이팅~
		 * 
		 * 
		 */
	}

}
